#include<stdio.h>
int main()
{
	double d = 1E10;
	int n = 9;    //整型家族的存储和浮点型的不同。
/* 
* (-1)^S * M *2^E
* (-1)^(0)* 1.001 * 2^3  
最高位是符号位，1为负0为正，-----> E是 8位，------->23位给M
最高位是符号位，1为负0为正，-----> E是11位，------->54位给M、
* 科学计数法中 E可以是负数
* 0.5 = (-1)^(0)* 1.0 * 2^(-1)   E = -1;------>  E+= 126; 
*/
	float* pfloat = (float*)&n;
	float ff = 5.5;
	//5.5 = 101.1 =1.011*2^2;
	//0 -129-2
//0-10000001-01100000000000000000000
// 0100-0000-1001-0000-0000-0000-0000-0000 = 0x40b00000

//当 M是全零，表示+-0；全1表示无穷大。
	{	printf("n=%d\n", n);
	printf("*pfloat = %f\n", *pfloat);//9 = 00000000000000000000000000001001 = 0-00000000-xxx为0;
	*pfloat = 9.0;  // 9.0 的二进制形式：1001.0
	//(-1)^0 * 1.001 *2^3
	//0 10000010  00100000000000000000000 n;
//int --->1000001000100000000000000000000 
	printf("n=%d\n", n);
	printf("*pfloat =%f\n", *pfloat); }
	/*
	*/
	return 0;
}