#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
#include<stdlib.h>
/*头文件    add.h
#ifndef __ADD_H__       //工程里需要加这两行 防止同一个头文件被应用多次
#define __ADD_H__
int Add(int x, int u);
#endif     可以加可以不加
 函数的声明放在.h内， 先声明后使用
 函数的定义放在1.c，主函数里引用头文件。
 _________________________________________________________________________________________*/
/*需调用的函数 add.c
*/
/*主程序
*/
int main()
{
//_________________________________________________________________________________________
//函数的嵌套调用和链式访问
// 把一个函数的返回值作为另一个函数的参数。
	printf("%d", printf("%d", printf("%d", 43)));// 恶心人。 printf的返回值是打印出来的个数
//_________________________________________________________________________________________

	return 0;
}